Revit 2027 API
BuiltInFailures.SketchFailures.InvalidSketchForFloor Property
 Floor sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSketchForFloor { get; }
Public Shared ReadOnly Property InvalidSketchForFloor As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSketchForFloor {
	FailureDefinitionId^ get ();
}
static member InvalidSketchForFloor : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace